<h1>Join on index</h1>

In [11]:
import pandas as pd

In [12]:
D = {
    'id_1': [1, 1, 2, 2, 3],
    'id_2': [1, 2, 1, 2, 1],
    'value': [11, 12, 21, 22, 31]
}

df1 = pd.DataFrame(D)
df1.set_index(['id_1', 'id_2'], inplace=True)

D = {
    'id_1': [1, 1, 2, 4, 4],
    'id_2': [1, 2, 1, 1, 2],
    'value': [11, 12, 21, 41, 42]
}

df2 = pd.DataFrame(D)
df2.set_index(['id_1', 'id_2'], inplace=True)

<h3>inner join</h3>

In [13]:
df1.join(df2, how='inner', rsuffix='_')

           value  value_
id_1 id_2
1    1        11      11
     2        12      12
2    1        21      21

<h3>left join</h3>

In [16]:
df1.join(df2, how='left', rsuffix='_')

           value  value_
id_1 id_2
1    1        11    11.0
     2        12    12.0
2    1        21    21.0
     2        22     NaN
3    1        31     NaN

<h3>right join</h3>

In [15]:
df1.join(df2, how='right', rsuffix='_')

           value  value_
id_1 id_2
1    1      11.0      11
     2      12.0      12
2    1      21.0      21
4    1       NaN      41
     2       NaN      42